#language: ru

@tree

Функционал: Тестирование документа Продажа товара

Как Тестировщик я хочу
проверить работу документа Продажи товара
чтобы избежать ошибок в рабочей базе

Контекст: 
	Дано Я открыл сеанс TestClient от имени "Администратор" с паролем "" или подключаю уже существующий

Сценарий: Тестирование документа Продажа товара
* Открытие списка документов
	И я закрываю все окна клиентского приложения
	И я перехожу по навигационной ссылке "e1cib/list/Документ.РасходТовара"
* Создание нового документа и заполнение шапки
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Все для дома"'
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	Тогда открылось окно 'Контрагенты'
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000002' | 'Покупатели'   |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'              |
		| '000000014' | 'Магазин "Бытовая техника"' |
	И в таблице "Список" я выбираю текущую строку
	Тогда элемент формы с именем "Покупатель" стал равен 'Магазин "Бытовая техника"'
	И элемент формы с именем 'ВидЦен' стал равен 'Мелкооптовая'	
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Большой'
	Тогда элемент формы с именем "Склад" стал равен 'Большой'	
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'
	Тогда элемент формы с именем "Валюта" стал равен 'Рубли'	
* Проверка изменения вида цены
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000002' | 'Покупатели'   |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'    |
		| '000000015' | 'Магазин "Обувь"' |
	И в таблице "Список" я выбираю текущую строку
	Тогда элемент формы с именем "Покупатель" стал равен 'Магазин "Обувь"'
	И элемент формы с именем 'ВидЦен' стал равен 'Розничная'
* Проверка доступности валюты взаиморасчетов
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	Тогда элемент формы с именем "Валюта" отсутствует на форме
* Работа с табличной частью
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000001' | 'Обувь'        |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Артикул'  | 'Код'       | 'Наименование' |
		| 'ОБ-00100' | '000000020' | 'Валенки'      |
	И в таблице "Список" я выбираю текущую строку
* Проверка заполнения табличной части
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'   | 'Цена'     | 'Количество' | 'Сумма'    |
		| '1' | 'Валенки' | '2 100,00' | '1,00'       | '2 100,00' |
* Проверка итогов
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '1'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '2 100'
* Добавление новой строки
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	И я нажимаю на кнопку с именем 'ФормаИерархическийСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'  |
		| '000000012' | 'Электротовары' |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000039' | 'Телевизоры'   |
	И в таблице "Список" я выбираю текущую строку
	И в таблице "Список" я перехожу к строке:
		| 'Артикул' | 'Код'       | 'Наименование' |
		| 'Н657'    | '000000040' | 'Sony К3456P'  |
	И в таблице "Список" я выбираю текущую строку
* Проверка итогов
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '2'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '9 100'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'	
* Изменение количества
	И в таблице "Товары" я перехожу к первой строке
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '10,00'
	И я завершаю редактирование строки
* Проверка итогов
	И элемент формы с именем 'ТоварыИтогКоличество' стал равен '11'
	И элемент формы с именем 'ТоварыИтогСумма' стал равен '28 000'	
* Проведение документа	
	И я нажимаю на кнопку с именем 'ФормаПровести'
* Проверка печатной формы Расходной накладной
	И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
	Дано Табличный документ 'SpreadsheetDocument' равен макету "РасходнаяНакладная" по шаблону
	И я закрываю текущее окно
* Проверка регистра взаиморасчетов
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
	Тогда таблица "Список" содержит строки:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Контрагент'      | 'Сумма'     | 'Валюта' |
		| '*'      | 'Продажа *'   | '1'            | 'Магазин "Обувь"' | '28 000,00' | 'Рубли'  |
* Проверка регистра продаж
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр продаж'
	Тогда таблица "Список" содержит строки:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Покупатель'      | 'Сумма'     | 'Товар'       | 'Количество' |
		| '*'      | 'Продажа *'   | '1'            | 'Магазин "Обувь"' | '21 000,00' | 'Валенки'     | '10,00'      |
		| '*'      | 'Продажа *'   | '2'            | 'Магазин "Обувь"' | '7 000,00'  | 'Sony К3456P' | '1,00'       |
* Проверка регистра товарных запасов
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр товарных запасов'
	Тогда таблица "Список" содержит строки:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Склад'   | 'Товар'       | 'Количество' |
		| '*'      | 'Продажа *'   | '1'            | 'Большой' | 'Валенки'     | '10,00'      |
		| '*'      | 'Продажа *'   | '2'            | 'Большой' | 'Sony К3456P' | '1,00'       |
* Номер
	И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'
	И я запоминаю значение поля "Номер" как "$Номер$"		
	И я закрываю текущее окно
* Проверка создания
	И таблица "Список" содержит строки:
		| 'Номер'   |
		| '$Номер$' |
	И в таблице "Список" я перехожу к строке:
		| 'Номер'   |
		| '$Номер$' |
* Создать на основании Поступление денег
	И я нажимаю на кнопку с именем 'ФормаДокументПоступлениеДенегСоздатьНаОсновании'
	И из выпадающего списка с именем "РасчетныйСчетПокупателя" я выбираю точное значение 'Основной'
	И из выпадающего списка с именем "РасчетныйСчет" я выбираю точное значение 'Основной '
	И в поле с именем 'Сумма' я ввожу текст '28 000,00'
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	И я нажимаю на кнопку с именем 'ФормаПровести'
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
	Тогда таблица "Список" содержит строки:
		| 'Период' | 'Регистратор'          | 'Номер строки' | 'Контрагент'      | 'Сумма'     | 'Валюта' |
		| '*'      | 'Поступление денег 0*' | '1'            | 'Магазин "Обувь"' | '28 000,00' | 'Рубли'  |
	И я закрываю текущее окно
* Удаление созданного документа
	И в таблице "Список" я перехожу к строке:
		| 'Номер'   |
		| '$Номер$' |
	И я нажимаю на кнопку с именем 'ФормаУдалить'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button0'	
	И я закрываю все окна клиентского приложения
